cyclone-separator/CFD/constant/couplingProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/


FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          couplingProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//===========================================================================//
// sub-models & settings

modelType "A"; // A or B

// Number of DEM steps between exchanges: 1000 x 1e-6 s = 0.001 s.
couplingInterval 1000;

voidFractionModel divided;//centre;//

locateModel engine;//engineIB;//

meshMotionModel noMeshMotion;

IOModel basicIO;

probeModel off;

dataExchangeModel twoWayMPI;

averagingModel dilute;

clockModel off;//standardClock;//

smoothingModel off;// localPSizeDiffSmoothing;// constDiffSmoothing; //

forceModels
(
    //GidaspowDrag
    //BeetstraDrag
    DiFeliceDrag
    gradPForce
    viscForce
    //KochHillDrag
    //DEMbasedDrag
    //RongDrag
    Archimedes
    //volWeightedAverage
    //totalMomentumExchange
    //particleCellVolume
    //fieldTimeAverage
    fieldStore
    //fieldVolWeighted
);

momCoupleModels
(
    implicitCouple
);

//turbulenceModelType "RASProperties";//"LESProperties";//OFversion24x
turbulenceModelType turbulenceProperties;//"LESProperties";//OFversion30x

//===========================================================================//
// sub-model properties

localPSizeDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    dSmoothingLength 1.5e-3;
    Csmoothing    1.0;
}

constDiffSmoothingProps
{
    lowerLimit 0.1;
    upperLimit 1e10;
    smoothingLength 1.5e-3;
}

implicitCoupleProps
{
    velFieldName            "U";
    granVelFieldName        "Us";
    voidfractionFieldName   "voidfraction";
}

ArchimedesProps
{
    densityFieldName "rho";
    gravityFieldName "g";
}
gradPForceProps
{
    pFieldName          "p";
    densityFieldName    "rho";
    voidfractionFieldName "voidfraction";
    velocityFieldName   "U";
    interpolation       true;
}

viscForceProps
{
    velocityFieldName   "U";
    densityFieldName    "rho";
    voidfractionFieldName "voidfraction";
    interpolation       true;
}
volWeightedAverageProps
{
    scalarFieldNames
    (
        voidfraction
    );
    vectorFieldNames
    (
    );
    upperThreshold 0.999;
    lowerThreshold 0;
    verbose true;
}
totalMomentumExchangeProps
{
    implicitMomExFieldName "Ksl";
    explicitMomExFieldName "none";
    fluidVelFieldName "U";
}
GidaspowDragProps
{
    verbose true;
    interpolation true;
    phi 1;
}
DEMbasedDragProps
{
}

DiFeliceDragProps
{
    velFieldName            "U";
    granVelFieldName        "Us";
    densityFieldName        "rho";
    voidfractionFieldName   "voidfraction";
    interpolation true;
}

KochHillDragProps
{
    velFieldName            "U";
    densityFieldName        "rho";
    voidfractionFieldName   "voidfraction";
    interpolation           true;
}

BeetstraDragProps
{
    rhoParticle     2000.;
    interpolation true;
    useFilteredDragModel ;
    useParcelSizeDependentFilteredDrag ;
    k       0.05;
    aLimit  0.0;
//    verbose true;
}

RongDragProps
{
    verbose true;
    interpolation true;
    implForceDEMaccumulated true;
}

virtualMassForceProps
{
}

particleCellVolumeProps
{
    upperThreshold 0.999;
    lowerThreshold 0.;
    verbose true;
}

fieldStoreProps
{
    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
}

fieldVolWeightedProps
{
    startTime 0;

    scalarFieldNames
    (
    );

    vectorFieldNames
    (
        "U"
    );
    useVolumeFraction true;
    volumeFractionName "voidfraction";
}

oneWayVTKProps
{
    couplingFilename "vtk_out%4.4d.vtk";
    maxNumberOfParticles 30000;
}

twoWayFilesProps
{
    maxNumberOfParticles 10100;
}

centreProps
{
}

"(engineProps|turboEngineProps|turboEngineM2MProps)"
{
    treeSearch true;
}

engineIBProps
{
    treeSearch true;
    zSplit 8;
    xySplit 16;
}

dividedProps
{
    // Required by CFDEM in cfdem:local (OpenFOAM-5.x build)
    alphaMin    0.1;
}

"(twoWayMPIProps|M2MProps)"
{
    liggghtsPath "../DEM/in.liggghts_run";
}
// ************************************************************************* //
