cyclone-separator/CFD/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    body
    {
        type            wall;
        inGroups        1(wall);
        nFaces          162148;
        startFace       2145117;
    }
    inlet
    {
        type            patch;
        nFaces          486;
        startFace       2307265;
    }
    outlet
    {
        type            patch;
        nFaces          1804;
        startFace       2307751;
    }
)

// ************************************************************************* //
